{"id":21,"page":"underrated","name":"The Life of David Gale (2003)","description":"\\n                        The mystery of one man's guilt or innocence literally becomes a matter of life and death in this drama. David Gale (Kevin Spacey) was the head of the philosophy department at Austin University and the author of several well-regarded books; he was also an active and visible member of Deathwatch, an anti-capital punishment activist group. One of Gale's best friends was Constance Harraway (Laura Linney), a fellow Deathwatch activist with whom he became especially close, particularly since Gale's wife, Sharon (Elizabeth Gast), who had taken a lover in Spain, was usually absent. One night, Gale was seduced by an attractive student from his class, Berlin (Rhona Mitra), who had too much to drink; later, the remorseful student accused Gale of rape. While Gale was eventually cleared of the charges, the negative publicity cost him his career as an educator, and with no job and no wife, Gale turned to drink. When Harraway was found raped and murdered a few years later, Gale was charged with the crime, and convicted despite the best efforts of his well-meaning but ineffectual lawyer Braxton Belyeu (Leon Rippy). Now Gale awaits execution, and less than a week before his date with the fatal injection, Gale agrees to tell his story to Bitsey Bloom (Kate Winslet), a nervy journalist from a major newsmagazine, who arrives with her assistant, Zack Stemmons (Gabriel Mann). As Bloom discusses the facts of the Harraway murder with Gale, it occurs to her that the details simply don't add up, and soon a mysterious stranger slips evidence to her that suggests Gale has been framed -- leaving Bloom and Stemmons only a few days to solve the mystery and save Gale from the executioner. The Life of David Gale was co-produced by actor Nicolas Cage, who originally commissioned the script and intended to star in the film before prior commitments led him to hand the project over to director Alan Parker.\\n                    ","ratings":[{"critic":"RT critics","rating":"Crap"},{"critic":"RT audience","rating":"Really really good"},{"critic":"RT audience","rating":"Really good"}],"categories":["Drama","Mystery & Suspense","Crime","Thriller"],"imageName":"The Life of David Gale (2003)"}